common/models/Menu.php

SELECT * FROM `menu` WHERE (`status`=1) AND (`parent_id`=7) AND (`level`=2) AND (`type`=0) ORDER BY `sort`
---
    public static function getSecondMenu($pid = 0) {

        $slist = self::find()
                ->where(['status'=>1,'parent_id'=>$pid,'level'=>2,'type'=>0])
                ->orderBy('sort asc')
                ->all();