frontend/views/layouts/main.php

SELECT * FROM `basic_setting`
---
<?php
    $menu = MenuService::getFrontMenu();
    //查询基本信息
    $basic = BasicSetting::find()->one();

SELECT * FROM `banners` WHERE (`menu_id`=7) AND (`status`=1)
---
        ]);
    } else if ($this->context->action->id == "product-list" || $this->context->action->id == "disclosure-list" || $this->context->action->id == "product-detail" ) {
        $mlist = MenuService::getSecondMenu(MenuIdEnum::ID_PRODUCT);
        $banner = Banners::findOne([
            'menu_id' => MenuIdEnum::ID_PRODUCT,
            'status' => 1
        ]);