common/services/MenuService.php

SELECT * FROM `menu` WHERE (`status`=1) AND (`type`=1) ORDER BY `sort`
---
    public static function getMenu()
    {
        $list = Menu::find()->where([
            'status' => MenuEnum::STATUS_DISPLAY_YES,
            'type' => MenuEnum::TYPE_BACKEND
        ])->orderBy('sort asc')->all();

SELECT * FROM `menu` WHERE (`status`=1) AND (`type`=0) AND (`parent_id`=7) ORDER BY `sort`
---
    public static function getSecondMenu($parent_id)
    {
        $list = Menu::find()->where([
            'status' => MenuEnum::STATUS_DISPLAY_YES,
            'type' => MenuEnum::TYPE_FRONTEND,
            'parent_id' => $parent_id,
        ])->orderBy('sort asc')->all();

SELECT * FROM `menu` WHERE (`status`=1) AND (`type`=0) ORDER BY `sort`
---
    public static function getFrontMenu()
    {
        $list = Menu::find()->where([
            'status' => MenuEnum::STATUS_DISPLAY_YES,
            'type' => MenuEnum::TYPE_FRONTEND
        ])->orderBy('sort asc')->all();